In [2]:
import pandas as pd
import pandasql as psql

In [3]:
data = pd.read_csv("../employee_dataset.csv")
data.head()

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

In [4]:
def query(_query, data = data):
    return psql.sqldf(_query, locals())

### Sample Query

In [69]:
query('SELECT * from data')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
...,...,...,...,...,...,...,...,...
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770,Intern,3.3

### 1. Print the first five rows

In [70]:
query('SELECT * from data LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

### 2. Print the number of rows

In [71]:
query('SELECT COUNT(*) FROM data')

   COUNT(*)
0    300000

### 3. Print the first five rows of the Company_Name and Employment_Status Column

In [72]:
query('SELECT Company_Name, Employment_Status FROM data LIMIT 5')

                   Company_Name Employment_Status
0                James and Sons         Full Time
1                 Nichols-James         Full Time
2                     Scott Inc         Full Time
3  Johnston, Fleming and Tanner         Full Time
4      Baker, Allen and Edwards         Full Time

### 4. Print the first five rows where the Employee_Rating > 4.5

In [73]:
query('SELECT * FROM data WHERE Employee_rating > 4.5 LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
1,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
2,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
3,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860,Full Time,4.8
4,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7

### 5. Print the number of rows having Employee_Salary > 600000

In [74]:
query('SELECT COUNT(*) FROM data WHERE Employee_Salary > 600000')

   COUNT(*)
0    120013

### 6. Print the number of rows with Employee_Salary > 600000 and Employee_Rating > 4.5

In [75]:
query('SELECT COUNT(*) FROM data WHERE Employee_Salary > 600000 AND Employee_Rating > 4.5')

   COUNT(*)
0     10766

### 7. Print the first five rows with Employee_Salary > 600000 and Employee_Rating > 4.5

In [76]:
query('SELECT * FROM data WHERE Employee_Salary > 600000 AND Employee_Rating > 4.5 LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
1,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
2,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7
3,Jonathan Armstrong,Scott Inc,Trading standards officer,Aliciafort,San Marino,902300,Full Time,4.8
4,Lori Smith,Thomas-Spencer,Optometrist,New Cindychester,Venezuela,687310,Full Time,4.8

### 8. Print all the distinct companies in the dataset

In [77]:
query('SELECT DISTINCT Company_Name FROM data')

                      Company_Name
0                   James and Sons
1                    Nichols-James
2                        Scott Inc
3     Johnston, Fleming and Tanner
4         Baker, Allen and Edwards
5                      Andrade LLC
6                     Matthews Inc
7                     Taylor-Ramos
8   Campos, Reynolds and Mccormick
9          White, Mcclain and Cobb
10                  Thomas-Spencer
11                Bullock-Carrillo
12               Marshall-Holloway
13      Wallace, Smith and Shepard
14                       Nelson-Li

### 9. Print the number of distinct companies in the dataset

In [78]:
query('SELECT COUNT(DISTINCT Company_Name) FROM data')

   COUNT(DISTINCT Company_Name)
0                            15

### 10. Print all the distinct companies, city pairs in the dataset

In [79]:
query('SELECT DISTINCT Company_Name, Employee_City FROM data')

                     Company_Name      Employee_City
0                  James and Sons     New Russellton
1                   Nichols-James  North Melissafurt
2                       Scott Inc           Wardfort
3    Johnston, Fleming and Tanner     West Jamesview
4        Baker, Allen and Edwards          Whiteside
..                            ...                ...
145       White, Mcclain and Cobb       Ricardomouth
146                 Nichols-James          Whiteside
147  Johnston, Fleming and Tanner     New Russellton
148                     Scott Inc     New Russellton
149                James and Sons       Whitakerbury

[150 rows x 2 columns]

### 11. Print the number of distinct companies, city pairs in the dataset

In [80]:
query('SELECT COUNT(*) FROM (SELECT DISTINCT Company_Name, Employee_City FROM data)')

   COUNT(*)
0       150

### 12. Print the number of Full time employees in the dataset.

In [81]:
query('SELECT * FROM data WHERE Employment_Status = "Full Time"')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
...,...,...,...,...,...,...,...,...
240005,William Rodriguez,Scott Inc,Ergonomist,Whiteside,New Zealand,214400,Full Time,1.5
240006,Steven Thornton,"Baker, Allen and Edwards",Patent examiner,Aliciafort,Benin,60240,Full Time,4.3
240007,Kelly Bennett,"White, Mcclain and Cobb","Radiographer, therapeutic",Wardfort,Fiji,182270,Full Time,3.6
240008,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
240009,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4

### 13. Print the number of employees with job title either 'Production engineer' or 'New Russellton'.

In [82]:
query('SELECT COUNT(*) FROM data WHERE Employee_Job_Title = "Production engineer" Or "New Russellton"')

   COUNT(*)
0     15003

### 14. Print the number of employees with job title either 'Production engineer' and company name 'Scott Inc'

In [83]:
query('SELECT COUNT(*) FROM data WHERE Employee_Job_Title = "Production engineer" AND Company_Name = "Scott Inc"')

   COUNT(*)
0      1036

### 15. Print the number of employees with job title either 'Production engineer' or 'New Russellton' and company name either 'Scott Inc' or 'Baker, Allen and Edwards'.

In [84]:
query('SELECT COUNT(*) FROM data WHERE (Employee_Job_Title = "Production engineer" OR "New Russellton") AND (Company_Name = "Scott Inc" OR "Baker, Allen and Edwards")')

   COUNT(*)
0      1036

### 16. Print the number of distinct cities with employees having job title either 'Production engineer' or 'New Russellton' and company name either 'Scott Inc' or 'Baker, Allen and Edwards'.

In [86]:
query('SELECT COUNT(DISTINCT Employee_city) FROM data WHERE (Employee_Job_Title = "Production engineer" OR "New Russellton") AND (Company_Name = "Scott Inc" OR "Baker, Allen and Edwards")')

   COUNT(DISTINCT Employee_city)
0                             10

### 17. Print the number of Intern employees in the dataset.

In [87]:
query('SELECT COUNT(*) FROM data WHERE Employment_Status = "Intern"')

   COUNT(*)
0     59990

### 18. Print the number of employees with first name 'Matthew'.

In [93]:
query('SELECT COUNT(*) FROM data WHERE SUBSTR(Name, 1, INSTR(Name, " ") -1 ) = "Matthew"')

   COUNT(*)
0      3063

### 19. Print the first five rows corresponding to the employees with highest salary

In [7]:
query('SELECT * FROM data ORDER BY Employee_Salary DESC LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0
1,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980,Full Time,2.0
2,Richard Kennedy,Thomas-Spencer,Energy manager,Aliciafort,Cook Islands,999980,Full Time,2.4
3,Jason Jenkins,Taylor-Ramos,Sales promotion account executive,Aliciafort,Pakistan,999980,Full Time,2.6
4,Dennis Sexton,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,Kristaburgh,United Kingdom,999970,Full Time,0.9

### 20. Print the first five rows corresponding to the employees with the highest salary in 'James and Sons' company

In [10]:
query('SELECT * FROM data WHERE Company_Name = "James and Sons" ORDER BY Employee_Salary DESC LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Jared Rice,James and Sons,Naval architect,New Russellton,Saint Barthelemy,999960,Full Time,2.6
1,Jamie Parks,James and Sons,Trading standards officer,Ricardomouth,Botswana,999860,Full Time,4.8
2,Shannon Harrison,James and Sons,Optometrist,Aliciafort,Austria,999830,Full Time,0.9
3,Angela Baker,James and Sons,"Radiographer, therapeutic",New Cindychester,Uruguay,999790,Intern,3.6
4,Jessica Nixon,James and Sons,Ergonomist,New Russellton,Korea,999770,Intern,2.7

### 21. Print the first five rows corresponding to the employees with the highest salary working either in 'James and Sons' company or living in 'Wardfort' city

In [11]:
query('SELECT * FROM data WHERE Company_Name = "James and Sons" OR Employee_City = "Wardfort" ORDER BY Employee_Salary DESC LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980,Full Time,2.0
1,Jared Rice,James and Sons,Naval architect,New Russellton,Saint Barthelemy,999960,Full Time,2.6
2,Carolyn Lucas,Bullock-Carrillo,Actuary,Wardfort,Fiji,999930,Full Time,1.9
3,Mia Howard,Nelson-Li,Actuary,Wardfort,Turks and Caicos Islands,999920,Full Time,2.5
4,Anthony Anderson,"Johnston, Fleming and Tanner",Diplomatic Services operational officer,Wardfort,Bangladesh,999910,Full Time,1.9

### 22. Print the total number of distinct records in the data.

In [31]:
query("""SELECT COUNT(*) AS total_distinct 
FROM (SELECT DISTINCT Name, Company_Name, Employee_Job_Title, Employee_City, Employee_Country, Employee_Salary, Employment_Status, Employee_Rating 
FROM data)
AS distinct_data;""")

   total_distinct
0          300000

### 23. Print the mean salary of all the employees in the data

In [30]:
query("""SELECT AVG(Employee_Salary) AS mean_salary
FROM data;""")

     mean_salary
0  500224.207727

### 24. Print the mean rating of all the employees in the data

In [33]:
query("""SELECT AVG(Employee_Rating) AS mean_rating
FROM data;""")

   mean_rating
0     2.505955

### 25-27. Print the maximum, minimum and median Employee_Salary.

In [61]:
query("""
WITH SalaryStats AS (
    SELECT
        Employee_Salary,
        COUNT(*) OVER () AS total_rows,
        ROW_NUMBER() OVER (ORDER BY Employee_Salary) AS row_num
    FROM data
),
MedianCalc AS (
    SELECT 
        Employee_Salary
    FROM SalaryStats
    WHERE row_num = (total_rows + 1) / 2
        OR (total_rows % 2 = 0 AND row_num IN (total_rows / 2, total_rows / 2 + 1))
)
SELECT 
    (SELECT MAX(Employee_Salary) FROM data) AS max_salary,
    (SELECT MIN(Employee_Salary) FROM data) AS min_salary,
    AVG(Employee_Salary) AS median_salary
FROM MedianCalc;

""")

   max_salary  min_salary  median_salary
0      999990           0       500780.0

### 28-32. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

In [65]:
query("""
SELECT
    Company_Name,
    Count(*) AS frequency
FROM data
GROUP BY Company_Name
""")

                      Company_Name  frequency
0                      Andrade LLC      19983
1         Baker, Allen and Edwards      20084
2                 Bullock-Carrillo      20063
3   Campos, Reynolds and Mccormick      19927
4                   James and Sons      19868
5     Johnston, Fleming and Tanner      19811
6                Marshall-Holloway      19859
7                     Matthews Inc      20083
8                        Nelson-Li      20132
9                    Nichols-James      19911
10                       Scott Inc      20390
11                    Taylor-Ramos      20122
12                  Thomas-Spencer      20142
13      Wallace, Smith and Shepard      19364
14         White, Mcclain and Cobb      20261

2. Employee_Job_Title

In [66]:
query("""
SELECT
    Employee_Job_Title,
    Count(*) AS frequency
FROM data
GROUP BY Employee_Job_Title
""")

                                   Employee_Job_Title  frequency
0                                             Actuary      15030
1                                       Administrator      15222
2   Armed forces logistics/support/administrative ...      15050
3             Diplomatic Services operational officer      30137
4                                      Energy manager      15033
5                                     Equities trader      15000
6                                          Ergonomist      15006
7                        Garment/textile technologist      15183
8                        Investment banker, corporate      15008
9                                                Make      14741
10                                    Naval architect      14905
11                                        Optometrist      14838
12                                    Patent examiner      15085
13                                Production engineer      15003
14                          Radiographer, therapeutic      14882
15                         Regulatory affairs officer      14869
16                                Retail merchandiser      15033
17                  Sales promotion account executive      14820
18                          Trading standards officer      15155

3. Employee_City

In [67]:
query("""
SELECT
    Employee_City,
    Count(*) AS frequency
FROM data
GROUP BY Employee_City
""")

       Employee_City  frequency
0         Aliciafort      30037
1        Kristaburgh      30204
2   New Cindychester      29756
3     New Russellton      30001
4  North Melissafurt      30209
5       Ricardomouth      30052
6           Wardfort      30097
7     West Jamesview      29941
8       Whitakerbury      29854
9          Whiteside      29849

4. Employee_Country

In [68]:
query("""
SELECT
    Employee_Country,
    Count(*) AS frequency
FROM data
GROUP BY Employee_Country
""")

      Employee_Country  frequency
0          Afghanistan       1253
1              Albania       1193
2              Algeria       1178
3       American Samoa       1235
4              Andorra       1201
..                 ...        ...
238  Wallis and Futuna       1243
239     Western Sahara       1234
240              Yemen       1180
241             Zambia       1193
242           Zimbabwe       1253

[243 rows x 2 columns]

5. Employment_Status

In [10]:
query("""
SELECT
    Employment_Status,
    Count(*) AS frequency
FROM data
GROUP BY Employment_Status
""")

  Employment_Status  frequency
0         Full Time     240010
1            Intern      59990

### 33. Print the company with the most number of employees.

In [14]:
query("""
SELECT Company_Name
FROM data
GROUP BY Company_Name
ORDER BY Count(*) DESC
LIMIT 1;
""")

  Company_Name
0    Scott Inc

### 34. Print the number of employees in the above company.

In [16]:
query("""
SELECT COUNT(*) AS max_company_employees
FROM data
WHERE Company_Name = (
    SELECT Company_Name
    FROM data
    GROUP BY Company_Name
    ORDER BY Count(*) DESC
    LIMIT 1
    )
""")

   frequency
0      20390

### 35. Print the company with the least number of employees.

In [17]:
query("""
SELECT Company_Name
FROM data
GROUP BY Company_Name
ORDER BY Count(*) ASC
LIMIT 1;
""")

                 Company_Name
0  Wallace, Smith and Shepard

### 36. Print the number of employees in the above company.

In [25]:
query("""
SELECT COUNT(*) AS min_company_employees
FROM data
WHERE Company_Name = (
    SELECT Company_Name
    FROM data
    GROUP BY Company_Name
    ORDER BY COUNT(*) ASC
    LIMIT 1
    );
    """)

   min_company_employees
0                  19364

### 37. Print the employee details with the maximum salary

In [26]:
query("""
SELECT *
FROM data
WHERE Employee_Salary = (SELECT MAX(Employee_Salary) FROM data);
""")

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0

### 38. Print the employee details with the maximum rating

In [27]:
query("""
SELECT *
FROM data
WHERE Employee_Rating = (SELECT MAX(Employee_Rating) FROM data);
""")

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Joshua Huffman,James and Sons,Garment/textile technologist,New Russellton,Cook Islands,694760,Full Time,5.0
1,Alan Carlson,"Baker, Allen and Edwards",Diplomatic Services operational officer,Kristaburgh,Mongolia,491710,Intern,5.0
2,Lisa Summers,"Johnston, Fleming and Tanner",Regulatory affairs officer,North Melissafurt,Togo,933500,Full Time,5.0
3,Timothy Woods,"Johnston, Fleming and Tanner",Garment/textile technologist,Whiteside,United States Virgin Islands,367630,Full Time,5.0
4,Cameron Hawkins,Taylor-Ramos,Armed forces logistics/support/administrative ...,Wardfort,Tanzania,66570,Intern,5.0
...,...,...,...,...,...,...,...,...
2980,Michael Jordan,"Johnston, Fleming and Tanner",Naval architect,Whitakerbury,Philippines,474540,Full Time,5.0
2981,Rebecca Garrison,Nelson-Li,Production engineer,Whitakerbury,Ireland,592530,Full Time,5.0
2982,Daniel Jones,Taylor-Ramos,Sales promotion account executive,Kristaburgh,Sierra Leone,32160,Full Time,5.0
2983,Justin Mendez,Bullock-Carrillo,Regulatory affairs officer,New Cindychester,Colombia,374540,Full Time,5.0
2984,Doris Miller,Andrade LLC,Armed forces logistics/support/administrative ...,Wardfort,Kazakhstan,943340,Intern,5.0

### 39. Print the Company_Name with most number of employees in 'Wardfort' city.

In [34]:
query("""
SELECT Company_Name
FROM data
WHERE Employee_City = 'Wardfort'
GROUP BY Employee_City
ORDER BY COUNT(*) DESC
LIMIT 1;
""")

  Company_Name
0    Scott Inc

### 40. Print 'Employee_Salary' column as string.

In [36]:
query("""
SELECT CAST(Employee_Salary AS VARCHAR) AS Employee_Salary_Str
FROM data;
""")

       Employee_Salary_Str
0                   321520
1                   589090
2                   630890
3                   116400
4                   523499
...                    ...
299995               99670
299996              949580
299997              802830
299998              257240
299999              575770

[300000 rows x 1 columns]

### 41. Print the Employee_City with the most number of 'Production engineer'.

In [39]:
query("""
SELECT Employee_City
FROM data
WHERE Employee_Job_Title = 'Production engineer'
GROUP BY Employee_City
ORDER BY COUNT(*) DESC
LIMIT 1;
""")

  Employee_City
0    Aliciafort

### 42. Print the Company_Name with the most number of Full-time Employees.

In [43]:
query("""
SELECT Company_Name
FROM data
WHERE Employment_Status = 'Full Time'
GROUP BY Company_Name
ORDER BY COUNT(*) DESC
LIMIT 1;
""")

  Company_Name
0    Scott Inc

### 43. Print the Company_Name with the highest average 'Employee_Rating'.

### 44. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

### 45. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

### 46. Check if any of the columns has NULL values.

### 47. Print the data type of every column in the data.

### 48. Print the number of employees with Employee_Rating greater than the average Employee_Rating

### 49. Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating

### 50. Sort the table in ascending order of Employee_Salary

### 51. Sort the table in descending order of Employee_Rating

### 52. Print the name of 100th employee after sorting on Name column

### 53. Print the first 5 rows of the first 5 columns.

### 54. Print the number of employees whose first name starts with the letter 'V'.

### 55. Print the number of employees whose last name starts with the letter 'R'.

### 56. Select the rows 2 to 7 and the columns 3 to 7 (both included)